In [35]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [71]:
# Read in the data
csushpinsa_df = pd.read_csv('data\CSUSHPINSA.csv')
# Convert the date column to datetime
csushpinsa_df['DATE'] = pd.to_datetime(csushpinsa_df['DATE'])
csushpinsa_df.tail()

          DATE  CSUSHPINSA
430 2022-11-01     296.809
431 2022-12-01     294.266
432 2023-01-01     292.444
433 2023-02-01     293.390
434 2023-03-01     297.077

In [70]:
# read in the data
evacantusq176n_df = pd.read_csv('data\EVACANTUSQ176N.csv')
# add rows for missing months and fill with most recent value
evacantusq176n_df = evacantusq176n_df.set_index('DATE')
evacantusq176n_df.index = pd.to_datetime(evacantusq176n_df.index)
evacantusq176n_df = evacantusq176n_df.resample('MS').ffill()
evacantusq176n_df = evacantusq176n_df.reset_index()
evacantusq176n_df.tail()

          DATE  EVACANTUSQ176N
269 2022-09-01           15306
270 2022-10-01           14554
271 2022-11-01           14554
272 2022-12-01           14554
273 2023-01-01           15053

In [69]:
# read in the data
GDP_df = pd.read_csv('data\GDP.csv')
# add rows for missing months and fill with most recent value
GDP_df = GDP_df.set_index('DATE')
GDP_df.index = pd.to_datetime(GDP_df.index)
GDP_df = GDP_df.resample('MS').ffill()
GDP_df = GDP_df.reset_index()
GDP_df.tail()

          DATE        GDP
908 2022-09-01  25723.941
909 2022-10-01  26137.992
910 2022-11-01  26137.992
911 2022-12-01  26137.992
912 2023-01-01  26486.287

In [68]:
# read in the data
intdsrusm193n_df = pd.read_csv('data\INTDSRUSM193N.csv')
# convert the date column to datetime
intdsrusm193n_df['DATE'] = pd.to_datetime(intdsrusm193n_df['DATE'])
intdsrusm193n_df.tail()

          DATE  INTDSRUSM193N
855 2021-04-01           0.25
856 2021-05-01           0.25
857 2021-06-01           0.25
858 2021-07-01           0.25
859 2021-08-01           0.25

In [67]:
# read in the data
mortgage30us_df = pd.read_csv('data\MORTGAGE30US.csv')
# create a new dataframe with the 'DATE' column value being the first day of the month and make the 'MORTGAGE30US' column an average of the month
mortgage30us_df['DATE'] = pd.to_datetime(mortgage30us_df['DATE'])
mortgage30us_df['DATE'] = mortgage30us_df['DATE'].values.astype('datetime64[M]')
mortgage30us_df = mortgage30us_df.groupby('DATE').mean()
mortgage30us_df = mortgage30us_df.reset_index()
mortgage30us_df.tail()

          DATE  MORTGAGE30US
622 2023-02-01        6.2575
623 2023-03-01        6.5440
624 2023-04-01        6.3425
625 2023-05-01        6.4250
626 2023-06-01        6.7900

In [66]:
# read in the data
msacsr_df = pd.read_csv('data\MSACSR.csv')
# add rows for missing months and fill with most recent value
msacsr_df = msacsr_df.set_index('DATE')
msacsr_df.index = pd.to_datetime(msacsr_df.index)
msacsr_df = msacsr_df.resample('MS').ffill()
msacsr_df = msacsr_df.reset_index()
msacsr_df.tail()

          DATE  MSACSR
719 2022-12-01     8.5
720 2023-01-01     8.1
721 2023-02-01     8.3
722 2023-03-01     7.9
723 2023-04-01     7.6

In [65]:
# read in the data
mspus_df = pd.read_csv('data\MSPUS.csv')
# add rows for missing months and fill with most recent value
mspus_df = mspus_df.set_index('DATE')
mspus_df.index = pd.to_datetime(mspus_df.index)
mspus_df = mspus_df.resample('MS').ffill()
mspus_df = mspus_df.reset_index()
mspus_df.tail()

          DATE     MSPUS
716 2022-09-01  468000.0
717 2022-10-01  479500.0
718 2022-11-01  479500.0
719 2022-12-01  479500.0
720 2023-01-01  436800.0

In [64]:
# read in the data
permit_df = pd.read_csv('data\PERMIT.csv')
# convert the date column to datetime
permit_df['DATE'] = pd.to_datetime(permit_df['DATE'])
permit_df.tail()

          DATE  PERMIT
755 2022-12-01  1409.0
756 2023-01-01  1354.0
757 2023-02-01  1482.0
758 2023-03-01  1437.0
759 2023-04-01  1417.0

In [63]:
# read in the data
tlrescons_df = pd.read_csv('data\TLRESCONS.csv')
# convert the date column to datetime
tlrescons_df['DATE'] = pd.to_datetime(tlrescons_df['DATE'])
tlrescons_df.tail()

          DATE  TLRESCONS
251 2022-12-01     868435
252 2023-01-01     851235
253 2023-02-01     851533
254 2023-03-01     851460
255 2023-04-01     855206

In [62]:
# read in the data
umcsent_df = pd.read_csv(r'data\UMCSENT.csv')
# convert the date column to datetime
umcsent_df['DATE'] = pd.to_datetime(umcsent_df['DATE'])
umcsent_df.tail()

          DATE  UMCSENT
431 2022-12-01     59.7
432 2023-01-01     64.9
433 2023-02-01     67.0
434 2023-03-01     62.0
435 2023-04-01     63.5

In [72]:
# merge all the dataframes on the date column
df = pd.merge(csushpinsa_df, evacantusq176n_df, on='DATE')
df = pd.merge(df, GDP_df, on='DATE')
df = pd.merge(df, mortgage30us_df, on='DATE')
df = pd.merge(df, msacsr_df, on='DATE')
df = pd.merge(df, mspus_df, on='DATE')
df = pd.merge(df, permit_df, on='DATE')
df = pd.merge(df, tlrescons_df, on='DATE')
df = pd.merge(df, umcsent_df, on='DATE')
df

,DATE,CSUSHPINSA,EVACANTUSQ176N,GDP,MORTGAGE30US,MSACSR,MSPUS,PERMIT,TLRESCONS,UMCSENT
0,2002-01-01,116.437,14342,10783.500,6.9975,4.2,188700.0,1665.0,382979,93.0
1,2002-02-01,116.916,14342,10783.500,6.8925,4.0,188700.0,1787.0,391434,90.7
2,2002-03-01,117.929,14342,10783.500,7.0140,4.1,188700.0,1691.0,390942,95.7
3,2002-04-01,119.208,14207,10887.460,6.9850,4.3,187200.0,1669.0,404255,93.0
4,2002-05-01,120.787,14207,10887.460,6.8060,4.0,187200.0,1716.0,399164,96.9
...,...,...,...,...,...,...,...,...,...,...
248,2022-09-01,300.451,15306,25723.941,6.1120,9.7,468000.0,1588.0,889018,58.6
249,2022-10-01,298.672,14554,26137.992,6.9000,9.7,479500.0,1555.0,874105,59.9
250,2022-11-01,296.809,14554,26137.992,6.8050,9.4,479500.0,1402.0,869322,56.8
251,2022-12-01,294.266,14554,26137.992,6.3640,8.5,479500.0,1409.0,868435,59.7
252,2023-01-01,292.444,15053,26486.287,6.2725,8.1,436800.0,1354.0,851235,64.9

In [73]:
df.shape

(253, 10)

In [74]:
# determine the number of missing values in each column
df.isnull().sum()

DATE              0
CSUSHPINSA        0
EVACANTUSQ176N    0
GDP               0
MORTGAGE30US      0
MSACSR            0
MSPUS             0
PERMIT            0
TLRESCONS         0
UMCSENT           0
dtype: int64

In [75]:
# save the dataframe to a csv file
df.to_csv('data\housing_data.csv', index=False)